waweroit/STM32_09.GardeningBlackPillSTM32F411CEU6/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdbool.h>
#include <stdio.h>
#include <string.h>
#include "MoistureSensor.h"
#include "USARTCommunication.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_01_Pin GPIO_PIN_13
#define LED_01_GPIO_Port GPIOC
#define ADC_MoistureSensor_1_Pin GPIO_PIN_1
#define ADC_MoistureSensor_1_GPIO_Port GPIOA
#define ADC_MoistureSensor_2_Pin GPIO_PIN_2
#define ADC_MoistureSensor_2_GPIO_Port GPIOA
#define ADC_LightSensor_Pin GPIO_PIN_3
#define ADC_LightSensor_GPIO_Port GPIOA
#define WaterSensor1_Pin GPIO_PIN_5
#define WaterSensor1_GPIO_Port GPIOA
#define PIN_PB10_Pump_Pin GPIO_PIN_1
#define PIN_PB10_Pump_GPIO_Port GPIOB
#define PIN_PB11_Light_Pin GPIO_PIN_2
#define PIN_PB11_Light_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
